Open_Foam_Simulations/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    airInlet
    {
        type            patch;
        nFaces          3600;
        startFace       789732;
    }
    airOutlet
    {
        type            patch;
        nFaces          3600;
        startFace       793332;
    }
    airWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          14400;
        startFace       796932;
    }
)

// ************************************************************************* //
