Open_Foam_Simulations/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.251 -0.251  -0.251)
    (0.251 -0.251  -0.251)
    (0.251  0.251  -0.251)
    (-0.251  0.251  -0.251)
    (-0.251 -0.251 0.251)
    (0.251 -0.251 0.251)
    (0.251  0.251 0.251)
    (-0.251  0.251 0.251)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) fluid (60 60 60) simpleGrading (1 1 1)
);

defaultPatch
{
    type patch;
}

boundary
(
);

// ************************************************************************* //
